{
	"keynotes": [
		{
			"name": "Hanna Kurniawati",
			"date": "12th November 2025",
			"img" : "/img/keynotes/hanna.jpg",
			"title": "Sequential Decision-Making for Robots Operating in Non Deterministic and Partially Observable World",
			"webpage" : "https://users.cecs.anu.edu.au/~hannakur/",
			"abstract": "In recent years, robotics hardware has advanced tremendously, with increasingly affordable humanoids, quadrupeds, telepresence robots, and many more. Despite these advances, developing autonomous or semi-autonomous robots that can reliably, efficiently, and safely operate in our environments remains an open problem. Key to this difficulty is the ubiquity of uncertainty. These robots must compute effective strategies to achieve their goals even when the outcomes of their actions are uncertain, their sensors and perception systems are erroneous, and the environments they operate in are dynamic and only partially observable. Moreover, they must ensure safety for both the robots and the humans around them. However, the technology that enables robots to efficiently construct effective strategies in the presence of a wide variety of uncertainty is still lacking. In this talk, I will present some of our work in developing such a technology, specifically on our recent work in Partially Observable Markov Decision Processes (POMDPs) —the general and principled framework for sequential decision-making under uncertainty. I will also present how this technology can be applied for safety assurance of autonomous systems.", 
            "bio": "Hanna Kurniawati is a Professor at the ANU School of Computing and holds the SmartSat Chair for System Autonomy, Intelligence & Decision-Making. Hanna’s research spans robotics, decision-making under uncertainty, motion planning, computational geometry applications, integrated planning and learning, and reinforcement learning. Her works on scalable methods for planning under uncertainty have received multiple recognitions, including a student best paper award at ICAPS’15, a finalist for the best paper award at ICRA’15, and the RSS’21Test of Time Award. She has given keynote talks at IROS’18 and ICRA’25. Hanna was a Senior Editor of IEEE RA-L, the Award Chair of CoRL’22, a Program Co-Chair of ICRA’22, and is an Editor of IEEE TRO."
		},
		{
			"name": "Bistra Dilkina",
			"date": "13th November 2025",
			"img" : "/img/keynotes/bistra.png",
			"title": "Coming soon",
			"webpage" : "https://viterbi.usc.edu/directory/faculty/Dilkina/Bistra",
			"abstract": "Coming soon",
			"bio": "Bistra Dilkina is an Associate Professor of Computer Science and the Dr. Allen and Charlotte Ginsburg Early Career Chair in Computer Science at the University of Southern California, USA. Her research focuses on challenging computational problems in sustainability and sustainable development, particularly decision and optimization problems. She is interested in network design problems as they arise in large-scale wildlife conservation planning and urban planning. She is a USC CREATE research fellow and co-Director of the USC Center for AI in Society (CAIS), a joint effort between the USC Viterbi School of Engineering and the USC Suzanne Dworak-Peck School of Social Work. During 2013-2017, she was as an Assistant Professor in the College of Computing at the Georgia Institute of Technology and a co-director of the Data Science for Social Good Atlanta summer program."
		},
		{
			"name": "Son Tran",
			"date": "14th November 2025",
			"img" : "/img/keynotes/son.png",
			"title": "Knowledge Representation meets Automated Planning: From Reasoning about Actions and Change to Planning and  Model Reconciliation and Beyond",
			"webpage": "https://computerscience.nmsu.edu/facultydirectory/individual-bio-pages/son-tran.html",
			"abstract": "Knowledge representation and reasoning has been one of the most important research directions in AI. Research in KRR has played an important role in the development of several subareas such as reasoning about actions and change, commonsense reasoning, automated planning, etc. In this talk, I will discuss in depth the relationship between reasoning about actions and change and automated planning and their role in recent topics such as explainable AI and epistemic planning. I will conclude with a discussion on the role of LLM in KRR and planning in general.",
			"bio":  "Tran Cao Son is a Professor and Head of Computer Science at New Mexico State University, USA. His research is at the intersection of AI Planning, Scheduling and Knowledge Representation and Reasoning. With his students, Son received the Best Student Paper Award at ICAPS 2012, and his CpA(H) planner received the Best Planner Award in the non-observable and non-deterministic track at the 2008 International Planning Competition. He has served on a number of distinguished organising committees including  co-chair of the 12th International Conference on Logic Programming and Non-Monotonic Reasoning (LPNMR-2013) , co-Program Chair of the 33rd International Conference on Logic Programming (ICLP 2017), co-General Chair of the 35th International Conference on Logic Programming (ICLP 2019) and co-Program Chair of the 20th International Conference on Principles of Knowledge Representation and Reasoning (KR 2023). He was a member of the editorial board of the Artificial Intelligence journal (AIJ) from 2016 to 2020."

		}
	]
}


